Repository: gnunixon/buildcv
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ro

source: Studies
ro: Studii

source: Work Experience
ro: Experienţa de lucru

source: Awards
ro: Realizări

source: Skills
ro: Abilităţi

source: CVs
ro: CV-uri

source: Want a good CV?
ro: Îţi doreşti un CV frumos?

source: Manage your CVs here
ro: Administrează-ţi CV-urile aici

source: Try it now!
ro: Încearcă acum!

source: Login with Facebook account
ro: Loghează-te prin contul de Facebook

source: General informations about you
ro: Informaţii generale despre tine

source: Save and move next
ro: Salvează

source: List of all your studies
ro: Lista studiilor tale

source: From
ro: Din

source: To
ro: Până

source: School
ro: Instituţia

source: Faculty
ro: Facultatea

source: Work
ro: Experienţa de lucru

source: List of your profesional experience
ro: Lista locurilor tale de muncă

source: Institution
ro: Angajatorul

source: Position
ro: Funcţia

source: List of your awards, trainings etc.
ro: Lista realizărilor, trainingurilor la care ai participat, etc.

source: Year
ro: Anul

source: Title
ro: Titlul

source: Description
ro: Descrierea

source: List of all your skills
ro: Lista abilităţilor tale

source: Languages
ro: Limbi

source: Language
ro: Limba

source: Read
ro: Citit

source: Write
ro: Scris

source: Speak
ro: Vorbit

source: Generate CV
ro: Generează CV-ul

source: All your CVs
ro: Toate CV-urile tale
